prompt = """
- 請幫我搜尋109學年吳文傑老師開設的全英授課經濟學課程
- 這學期有沒有早八的社會學
- 我是國立政治大學的學生，我想找111學年第二學期，由吳岳剛老師開設的靜態影像設計，以學習基礎攝影技巧
- 有沒有幽默實用又生活化的民法概要
- 我最近對穆斯林的種族議題有興趣，請推薦一堂課給我
- 幫我找企業模式有關的實務課程
- 我想學輕鬆學印尼文，有推薦的課嗎
- 最近想了解金融市場跟銀行的運作模式，所以想修一學年的貨幣銀行學，幫我找一門
- 有沒有晚九，只需要口頭報告的營養學分
- 聽說政大有一個老師是台灣大車隊的副董事長，我想上他的管理學，請幫我搜尋
- 政大有沒有課程能幫我更熟悉如何寫數位學術期刊
- 我想知道如何做民意調查，幫我推薦一些課
- 我是政大民族系的學生，對民族文學很有興趣，請幫我推薦一堂有關民族文學的課
- 我是資管系的學生，想參加系學會舉辦的活動並完成服務學習，請問有哪些推薦的課程
- 最近的研究需要關於人口遷移測量的一些知識，幫我推薦相關課程
- 政治大學林怡伶老師的程式設計一課程怎麼樣？這課會不會很涼，還是會很甜？難易度如何呢？
- 政治大學林巧敏老師教的圖書館管理課程內容是什麼？這課難嗎？分數好拿嗎？
- 政治大學吳漢銘老師的統計學（一）課程教的是數統還是商統？考試會不會很刁難，分數甜嗎？
- 政治大學張仲豪老師的體育課（武術初級）會不會像其他體育課一樣很累？如果沒基礎，這課推不推薦？能輕鬆過嗎？
- 111-1 政治大學吳豐祥老師的科技與創新管理課內容實際嗎？這課可以輕鬆過嗎？分數好拿嗎？
- 110-2 政治大學林宛瑩老師的財務報表分析課老師嚴格嗎？會每堂課點名嗎？功課多不多，學習難度高嗎？
- 111-2 政治大學朱斌妤老師的溝通與協商課程，會跟老師有很多互動嗎？還是主要是學習相關知識？分數甜嗎？
- 111-1 政治大學甯方璽老師的測量學及實習課，老師上課內容豐富嗎？還是只是用PPT帶過？考試分數好拿嗎？
- 110-2 政治大學陳雅莉老師的大學英文（二）課，老師會常常請人回答問題嗎？有需要做報告或寫長篇文章嗎？
- 111-1 政治大學林信助老師的經濟學課，老師會點名嗎？功課多不多？上課會隨機抽人回答問題嗎？會有拍影片或報告嗎？
- 110-2 政治大學黃柏鈞老師的個體經濟學，這課和一般經濟學有什麼差異？學起來會很難嗎？
- 109-1 政治大學趙知章老師的生活中的生命科學，這通識課有助教嗎？會點名嗎？考試難不難？需要用到普通生物的知識嗎？
- 109-2 政治大學詹凌菁老師的高級會計學（二），修這課之前需要先修一般會計學嗎？功課多嗎？考試和點名情況如何？
- 111-2 政治大學陳立夫老師的土地行政課，課程內容是什麼？學習的深度如何？會有很多實地勘察類的報告嗎？
- 110-2 政治大學林文乙老師的橄欖球初級體育課，會不會曬太陽？容易受傷嗎？如果身體瘦弱，適合選這課嗎？

我這裡一共有 30 題的題目，請幫我提取問題你認為的關鍵字

然後用空格隔開輸出

所以你的輸出一樣會有 30 題，然後用 - 來分題
"""
